import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';

@Component({
  imports: [CommonModule],
  selector: 'app-news',
  templateUrl: './news.component.html'
})
export class NewsComponent {

  // مسار الصورة البديلة الافتراضية (شعار الوزارة)
  defaultImage = '/moi.png';

  // بيانات الخبر الرئيسي الكبير (على اليمين)
  mainNews = {
    title: 'تنفيذ حكم القتل تعزيراً بأحد الجناة في منطقة حائل',
    date: 'الخميس، 9 يوليو 2026',
    image: '' // مروكة فارغة هنا لتقوم الـ Template بعرض الشعار تلقائياً
  };

  // مصفوفة الأخبار الفرعية الأربعة (على اليسار)
  subNews = [
    {
      title: 'وزارة الداخلية تشارك في الملتقى السنوي السادس لإمارات المناطق والمبادرات التنموية بمنطقة القصيم',
      date: 'الخميس، 2 يوليو 2026',
      image: '/news1.png', // هنا صورة حقيقية ستظهر بشكل طبيعي
      hasLink: true
    },
    {
      title: 'ابتداءً من السبت.. فتح باب القبول للالتحاق بدورة بكالوريوس العلوم الأمنية لحاملي شهادة الثانوية العامة...',
      date: 'الخميس، 2 يوليو 2026',
      image: '', // ستتحول للشعار الافتراضي
      hasLink: false
    },
    {
      title: 'مصدر مسؤول بوزارة الداخلية الكشف عن ضبط شبكة إجرامية بمنطقة الرياض تمتهن تهريب المخدرات وترويجها...',
      date: 'الأربعاء، 1 يوليو 2026',
      image: '', // ستتحول للشعار الافتراضي
      hasLink: false
    },
    {
      title: 'وكيل وزارة الداخلية يطلع على مرافق إمارة منطقة القصيم ومنجزاتها المؤسسية والتنموية',
      date: 'الأربعاء، 1 يوليو 2026',
      image: '/news2.png', // هنا صورة حقيقية ستظهر بشكل طبيعي
      hasLink: true
    }
  ];
}